---
kind: type
id: T:Autodesk.Revit.DB.RectangularGridSegmentOrientation
source: html/cc712c10-e391-eaf3-0441-ecc183f26846.htm
---
# Autodesk.Revit.DB.RectangularGridSegmentOrientation

The orientation type of rectangular grid segment.

## Syntax (C#)
```csharp
public enum RectangularGridSegmentOrientation
```